

[
  {
    "groupName": "Mood & Emotion",
    "key": "mood",
    "description": "Select the primary emotional tone of the song. This will heavily influence the lyrical content and musical expression.",
    "qualities": [
      {"name": "Awe-inspiring", "description": "Evokes a feeling of reverential respect mixed with fear or wonder, like witnessing a grand natural spectacle."},
      {"name": "Brooding", "description": "Suggests deep unhappiness of thought; appearing darkly menacing."},
      {"name": "Calm", "description": "Peaceful, quiet, and without worry. A serene and tranquil atmosphere."},
      {"name": "Celebratory", "description": "Expresses joy and pride in an event or achievement. Festive and triumphant."},
      {"name": "Charming", "description": "Pleasant and attractive in a delightful way. Sweet and captivating."},
      {"name": "Cinematic", "description": "Suggests the epic, grand scale of a movie score. Dramatic and visually evocative."},
      {"name": "Confident", "description": "Feeling or showing certainty about something. Bold, assured, and self-reliant."},
      {"name": "Confused", "description": "Unable to think clearly or to understand what is happening. Disoriented and uncertain."},
      {"name": "Contemplative", "description": "Expressing or involving prolonged thought. Meditative, reflective, and introspective."},
      {"name": "Creepy", "description": "Causing an unpleasant feeling of fear or unease. Unsettling and strange."},
      {"name": "Dark", "description": "Gloomy, pessimistic, and serious. Lacking humor or light."},
      {"name": "Determined", "description": "Having made a firm decision and being resolved not to change it. Resolute and purposeful."},
      {"name": "Dreamy", "description": "Having a magical or pleasantly unreal quality. Ethereal and otherworldly."},
      {"name": "Emotional", "description": "Arousing or characterized by intense feeling. Passionate and heartfelt."},
      {"name": "Energetic", "description": "Showing or involving great activity or vitality. Lively and vigorous."},
      {"name": "Eerie", "description": "Strange and frightening. Unsettlingly mysterious."},
      {"name": "Exhilarating", "description": "Making one feel very happy, animated, or elated; thrilling."},
      {"name": "Fantasy", "description": "Imaginary and magical, evoking worlds of myth and legend."},
      {"name": "Foreboding", "description": "A feeling that something bad will happen; threatening."},
      {"name": "Grave", "description": "Giving cause for alarm; serious and solemn."},
      {"name": "Heartbreaking", "description": "Causing overwhelming sadness or sorrow."},
      {"name": "Heroic", "description": "Having the characteristics of a hero or heroine; very brave and grand."},
      {"name": "Hopeful", "description": "Feeling or inspiring optimism about a future event."},
      {"name": "Humorous", "description": "Causing laughter and amusement; comic and lighthearted."},
      {"name": "Inspirational", "description": "Providing creative or spiritual motivation."},
      {"name": "Intense", "description": "Of extreme force, degree, or strength. Powerful and concentrated."},
      {"name": "Joyful", "description": "Feeling, expressing, or causing great pleasure and happiness."},
      {"name": "Lonely", "description": "Sad because one has no friends or company; feeling of isolation."},
      {"name": "Magical", "description": "Beautiful or delightful in a way that seems removed from everyday life."},
      {"name": "Mysterious", "description": "Difficult or impossible to understand, explain, or identify."},
      {"name": "Nostalgic", "description": "A sentimental longing or wistful affection for a period in the past."},
      {"name": "Peaceful", "description": "Free from disturbance; tranquil and calm."},
      {"name": "Playful", "description": "Fond of games and amusement; lighthearted and fun."},
      {"name": "Quirky", "description": "Having or characterized by peculiar or unexpected traits or aspects."},
      {"name": "Reflective", "description": "Relating to or characterized by deep thought; thoughtful."},
      {"name": "Reverent", "description": "Feeling or showing deep and solemn respect."},
      {"name": "Romantic", "description": "Conducive to or characterized by the expression of love."},
      {"name": "Sad", "description": "Feeling or showing sorrow; unhappy."},
      {"name": "Serene", "description": "Calm, peaceful, and untroubled; tranquil."},
      {"name": "Solemn", "description": "Formal and dignified; not cheerful or smiling; serious."},
      {"name": "Somber", "description": "Dark or dull in color or tone; gloomy."},
      {"name": "Spooky", "description": "Sinister or ghostly in a way that is frightening or disturbing."},
      {"name": "Suspenseful", "description": "Arousing excited expectation or uncertainty about what may happen."},
      {"name": "Tense", "description": "Unable to relax because of nervousness, anxiety, or stimulation."},
      {"name": "Tragic", "description": "Causing or characterized by extreme distress or sorrow."},
      {"name": "Triumphant", "description": "Having won a battle or contest; victorious and celebratory."},
      {"name": "Uplifting", "description": "Inspiring happiness, optimism, or hope."},
      {"name": "Urgent", "description": "Requiring immediate action or attention."},
      {"name": "Vast", "description": "Of very great extent or quantity; immense and expansive."},
      {"name": "Vibrant", "description": "Full of energy and enthusiasm; bright and striking."},
      {"name": "Whimsical", "description": "Playfully quaint or fanciful, especially in an appealing and amusing way."},
      {"name": "Wistful", "description": "Having or showing a feeling of vague or regretful longing."}
    ]
  },
  {
    "groupName": "Lyrical Theme",
    "key": "lyricalTheme",
    "description": "Choose a core narrative or conceptual theme. This guides the storytelling and lyrical content of the song.",
    "qualities": [
      {"name": "Adventure", "description": "Lyrics about journeys, exploration, quests, and discovering the unknown."},
      {"name": "Betrayal", "description": "Focuses on deceit, broken trust, and the emotional fallout from being let down."},
      {"name": "Coming of Age", "description": "Themes of growth, self-discovery, and the transition from innocence to experience."},
      {"name": "Conflict", "description": "Lyrics about struggles, battles (internal or external), and opposition."},
      {"name": "Freedom", "description": "Exploring themes of liberation, independence, and breaking free from constraints."},
      {"name": "Heartbreak", "description": "Lyrics centered on the pain of a broken heart and the end of a relationship."},
      {"name": "Loss", "description": "Deals with themes of grief, bereavement, and the absence of someone or something important."},
      {"name": "Love", "description": "Exploring the complexities of romantic love, from new infatuation to deep, lasting bonds."},
      {"name": "Nature", "description": "Lyrics inspired by the natural world, its beauty, power, and connection to human life."},
      {"name": "Rebellion", "description": "Themes of defiance, anti-authoritarianism, and challenging the status quo."},
      {"name": "Redemption", "description": "A story of making amends, finding forgiveness, and atoning for past mistakes."},
      {"name": "Remembrance", "description": "Focuses on memory, honoring the past, and looking back on significant events."},
      {"name": "Revolution", "description": "Lyrics about uprising, radical change, and overthrowing a system."},
      {"name": "Sacrifice", "description": "Themes of giving up something important for a greater cause or for someone else."},
      {"name": "Satire", "description": "Uses humor, irony, or exaggeration to critique or mock societal norms or figures."},
      {"name": "Social Commentary", "description": "Lyrics that observe and critique aspects of society, politics, or culture."},
      {"name": "Spirituality", "description": "Exploring themes of faith, the divine, and the search for meaning beyond the material world."},
      {"name": "Survival", "description": "A narrative about enduring hardship, overcoming obstacles, and the will to live."},
      {"name": "Transformation", "description": "Focuses on personal change, metamorphosis, and becoming someone new."},
      {"name": "Unity", "description": "Lyrics that promote togetherness, solidarity, and collective strength."}
    ]
  },
  {
    "groupName": "Vocal Style",
    "key": "vocalStyle",
    "description": "Specify the desired vocal performance style. This influences performance directions in the generated lyrics.",
    "qualities": [
      {"name": "Angelic", "description": "A pure, light, and beautiful vocal quality, often with high notes and a smooth delivery."},
      {"name": "Aggressive", "description": "A forceful, confrontational, and powerful vocal delivery, common in punk and metal."},
      {"name": "Airy", "description": "A light, breathy, and delicate vocal style, often used for dreamy or ethereal effects."},
      {"name": "Belted", "description": "A strong, loud, and sustained vocal technique, often used for climactic moments in pop and ballads."},
      {"name": "Chanted", "description": "Rhythmic speaking or singing in unison or repetition, often with a spiritual or tribal feel."},
      {"name": "Crooned", "description": "A soft, low, and smooth style of singing, creating an intimate and romantic mood."},
      {"name": "Guttural", "description": "A harsh, throaty sound produced deep in the throat, common in some styles of metal and folk music."},
      {"name": "Melismatic", "description": "Singing a single syllable of text while moving between several different notes in succession."},
      {"name": "Monotonic", "description": "A vocal delivery with very little variation in pitch, creating a robotic or detached effect."},
      {"name": "Operatic", "description": "A powerful, formal, and highly trained vocal style associated with classical opera."},
      {"name": "Rapped", "description": "Rhythmic and rhyming speech that is chanted, a cornerstone of hip-hop."},
      {"name": "Raspy", "description": "A hoarse, rough, and gravelly vocal quality, often associated with blues and rock singers."},
      {"name": "Screamed", "description": "A harsh, loud, and often high-pitched vocal style used to express intense emotion."},
      {"name": "Spoken Word", "description": "Vocal performance that is spoken rather than sung, focusing on rhythm and cadence."},
      {"name": "Whispered", "description": "A very quiet, soft, and breathy vocal delivery, creating intimacy or suspense."}
    ]
  },
  {
    "groupName": "Narrative Dynamic",
    "key": "narrativeDynamic",
    "description": "Define the relationship or dynamic between the singers. This has a major impact on lyrical point-of-view and subtext. Choose 'Solo Narrative' for single singers.",
    "qualities": [
      {"name": "Romantic Couple", "description": "Deeply in love, partnership. Lyrics will be intimate and emotional."},
      {"name": "New Romance", "description": "The excitement, uncertainty, and passion of a blossoming relationship."},
      {"name": "Unrequited Love", "description": "One-sided love, longing, and yearning from one character's perspective."},
      {"name": "Heartbreak / Breakup", "description": "The sorrow, anger, or reflection after a relationship ends. Can be one-sided or a duet of conflicting feelings."},
      {"name": "Playful Friendship", "description": "Lighthearted, fun, and energetic chemistry between close friends."},
      {"name": "Supportive Friendship", "description": "Themes of loyalty, trust, and being there for one another through thick and thin."},
      {"name": "Found Family", "description": "A bond between unrelated people that is as strong as family. Themes of acceptance and belonging."},
      {"name": "Rivalry", "description": "Competitive, tense, and challenging dynamics. Can be playful or serious."},
      {"name": "Mentor & Mentee", "description": "A dynamic of guidance, teaching, and growth between two characters."},
      {"name": "Familial Bond", "description": "Themes of family ties, could be parent-child, siblings, etc. with love, conflict, or history."},
      {"name": "Solo Narrative (Introspective)", "description": "For a single singer. Lyrics will be personal, reflective, and focused on an internal journey."},
      {"name": "Solo Narrative (Observational)", "description": "For a single singer. Lyrics will tell a story about the world, other people, or events."}
    ]
  },
  {
    "groupName": "Genre & Style",
    "key": "genre",
    "description": "Provide a broad genre to guide the AI's understanding. This complements the specific style chosen later.",
    "qualities": [
      {"name": "Ambient", "description": "Focuses on tone and atmosphere over traditional structure."},
      {"name": "Blues", "description": "Characterized by specific chord progressions and soulful, gritty expression."},
      {"name": "Classical", "description": "Art music rooted in Western traditions, often orchestral."},
      {"name": "Country", "description": "Storytelling music with roots in American folk and blues."},
      {"name": "Dance", "description": "Music produced specifically for dancing, with a strong beat."},
      {"name": "Electronic", "description": "Music created with electronic instruments like synthesizers and drum machines."},
      {"name": "Experimental", "description": "Music that pushes boundaries and challenges conventions."},
      {"name": "Folk", "description": "Traditional, acoustic-based music that often tells a story."},
      {"name": "Funk", "description": "Highly rhythmic music with a strong groove from bass and drums."},
      {"name": "Gospel", "description": "Characterized by dominant vocals and strong use of harmony, with Christian lyrical themes."},
      {"name": "Hip-hop", "description": "Music featuring rapping, a rhythmic and rhyming vocal style."},
      {"name": "Jazz", "description": "Characterized by swing, improvisation, and complex harmonies."},
      {"name": "Latin", "description": "Music from Latin America, featuring a wide array of rhythmic styles."},
      {"name": "Lofi", "description": "Music with a deliberately unpolished, 'low-fidelity' sound quality."},
      {"name": "Metal", "description": "A form of rock music characterized by loud, distorted guitars and aggressive vocals."},
      {"name": "Minimalist", "description": "Music that uses limited or repetitive musical materials."},
      {"name": "New Age", "description": "Down-tempo, inspirational music intended to create artistic and optimistic feelings."},
      {"name": "Orchestral", "description": "Music composed for a large ensemble of instruments, like a symphony orchestra."},
      {"name": "Pop", "description": "Mainstream music with catchy melodies and broad appeal."},
      {"name": "Punk", "description": "Fast, aggressive rock music with a rebellious, anti-establishment attitude."},
      {"name": "Reggae", "description": "Music from Jamaica with a characteristic offbeat rhythm."},
      {"name": "Rock", "description": "A broad genre of popular music centered on the electric guitar, bass, and drums."},
      {"name": "Soul", "description": "A combination of R&B and gospel music, with passionate, heartfelt vocals."},
      {"name": "Synthwave", "description": "A modern electronic genre inspired by 1980s film and video game soundtracks."}
    ]
  },
  {
    "groupName": "Pace & Dynamics",
    "key": "pace",
    "description": "Define the song's energy level and changes in volume. This affects the arrangement and performance directions.",
    "qualities": [
      {"name": "Accelerating", "description": "Gradually increasing in speed over time."},
      {"name": "Adagio", "description": "To be performed at a slow tempo."},
      {"name": "Allegro", "description": "To be performed at a fast, quick, and bright tempo."},
      {"name": "Andante", "description": "To be performed at a moderately slow, walking pace."},
      {"name": "Building", "description": "Gradually adding layers and intensity."},
      {"name": "Crescendo", "description": "A gradual increase in loudness."},
      {"name": "Decrescendo", "description": "A gradual decrease in loudness."},
      {"name": "Driving", "description": "A strong, forward-propelling rhythm."},
      {"name": "Fast", "description": "A high tempo or speed."},
      {"name": "Frenetic", "description": "Fast and energetic in a rather wild and uncontrolled way."},
      {"name": "Gradual", "description": "Slowly and steadily progressing."},
      {"name": "Lento", "description": "To be performed at a very slow tempo."},
      {"name": "Loud", "description": "A high volume or intensity."},
      {"name": "Piano", "description": "To be performed softly."},
      {"name": "Rhythmic", "description": "Having a strong, regular, repeated pattern of sound."},
      {"name": "Slowing", "description": "Gradually decreasing in speed over time."},
      {"name": "Soft", "description": "A low volume or intensity."},
      {"name": "Staccato", "description": "With each sound or note sharply detached or separated from the others."},
      {"name": "Sustained", "description": "Continuing for an extended period or without interruption."},
      {"name": "Tempo", "description": "The speed at which a passage of music is or should be played."},
      {"name": "Unstable", "description": "Prone to change, fail, or give way; not stable."}
    ]
  },
  {
    "groupName": "Instrumentation & Texture",
    "key": "instrumentation",
    "description": "Describe the overall sound palette. For example, 'Acoustic' favors non-electric instruments, while 'Thick' suggests many layers of sound.",
    "qualities": [
      {"name": "Acoustic", "description": "Music featuring instruments that produce sound through acoustic means, not electronic."},
      {"name": "Brass", "description": "Music dominated by brass instruments like trumpets, trombones, and horns."},
      {"name": "Choral", "description": "Music sung by a choir or having a choir-like quality."},
      {"name": "Dissonant", "description": "Lacking harmony; featuring harsh, clashing sounds."},
      {"name": "Echoing", "description": "Characterized by the heavy use of echo and reverb effects."},
      {"name": "Electronic", "description": "Music created with synthesizers, computers, and other electronic instruments."},
      {"name": "Ethereal", "description": "Extremely delicate and light in a way that seems too perfect for this world."},
      {"name": "Full-orchestra", "description": "Utilizing the complete range of instruments in a symphony orchestra."},
      {"name": "Harmonic", "description": "Characterized by pleasing and consonant harmony."},
      {"name": "Hollow", "description": "A sound that seems to have a space or emptiness within it."},
      {"name": "Monophonic", "description": "Consisting of a single musical line, without accompaniment."},
      {"name": "Piano", "description": "Music where the piano is the primary or sole instrument."},
      {"name": "Polyrhythmic", "description": "The simultaneous use of two or more conflicting rhythms."},
      {"name": "Pulsing", "description": "Characterized by a steady, throbbing beat."},
      {"name": "String", "description": "Music dominated by string instruments like violins, cellos, and guitars."},
      {"name": "Synthesized", "description": "Sound produced by an electronic synthesizer."},
      {"name": "Textural", "description": "Music where the focus is on the sonic textures rather than melody or rhythm."},
      {"name": "Thick", "description": "A sound with many layers of instruments or voices."},
      {"name": "Thin", "description": "A sound with very few layers, often sparse and simple."},
      {"name": "Woodwind", "description": "Music dominated by woodwind instruments like flutes, clarinets, and oboes."}
    ]
  },
  {
    "groupName": "Drum Styles",
    "key": "drumStyle",
    "description": "Select a specific rhythmic style for the drums.",
    "qualities": [
      {"name": "Boom Bap", "description": "A classic hip-hop rhythm with a hard-hitting kick and snare (kick, snare, kick-kick, snare)."},
      {"name": "Four-on-the-floor", "description": "A steady, driving beat with the kick drum on every beat (1, 2, 3, 4). Common in dance, house, and disco."},
      {"name": "Breakbeat", "description": "A syncopated, non-straight drum pattern, often sampled from funk records."},
      {"name": "Blast Beat", "description": "An extremely fast tempo drum pattern common in extreme metal, alternating between kick and snare."},
      {"name": "One-drop", "description": "A reggae rhythm where the kick and snare accent the third beat of the bar."},
      {"name": "Dembow", "description": "The characteristic rhythm of reggaeton (kick, snare, kick, snare-kick)."},
      {"name": "Half-time", "description": "A rhythm where the backbeat (snare/clap) is on beat 3 of a 4/4 bar, making the groove feel slower. Common in dubstep and trap."},
      {"name": "Shuffle", "description": "A rhythm based on triplets, giving it a swinging, bouncy feel. Common in blues and jazz."}
    ]
  },
  {
    "groupName": "Snare Sound",
    "key": "snareType",
    "description": "Choose the specific character of the snare drum or backbeat.",
    "qualities": [
      {"name": "Acoustic Snare", "description": "The natural sound of a standard snare drum, with a crisp, sharp crack."},
      {"name": "Brush Snare", "description": "A softer, sustained 'swish' sound created by using wire brushes instead of sticks. Common in jazz."},
      {"name": "Rimshot", "description": "A loud, sharp, cracking sound produced by hitting the rim and the head of the snare simultaneously."},
      {"name": "Cross-stick", "description": "A quiet, clicking 'tock' sound made by laying the stick across the snare and striking the rim."},
      {"name": "808 Snare", "description": "A classic electronic snare sound from the Roland TR-808, known for its sharp, snappy character."},
      {"name": "909 Snare", "description": "A punchy, powerful electronic snare from the Roland TR-909, often with adjustable 'snap' and 'tone'."},
      {"name": "Gated Reverb Snare", "description": "An iconic 80s sound: a loud snare with a large reverb that is abruptly cut off."},
      {"name": "Hand Clap", "description": "Using the sound of a hand clap, often layered, as the backbeat instead of a snare drum."}
    ]
  },
  {
    "groupName": "Special & Ancient Instruments",
    "key": "specialInstrument",
    "description": "Add the unique character of a special, ancient, or unconventional instrument to the song's texture.",
    "qualities": [
      {"name": "Bagpipes", "description": "A wind instrument with a powerful, droning sound, traditionally associated with Scotland."},
      {"name": "Crwth", "description": "A bowed lyre from Wales, with melody and drone strings, creating a raw, ancient sound."},
      {"name": "Didgeridoo", "description": "An Australian Aboriginal wind instrument that produces a deep, resonant drone."},
      {"name": "Duduk", "description": "An ancient Armenian double-reed woodwind instrument with a mournful, haunting sound."},
      {"name": "Hurdy-gurdy", "description": "A stringed instrument that produces sound by a hand-crank-turned, rosined wheel rubbing against the strings."},
      {"name": "Jew's Harp", "description": "A small instrument played in the mouth, creating a twanging, hypnotic sound."},
      {"name": "Ocarina", "description": "A small, ancient wind instrument, typically made of ceramic or clay, with a soft, hollow tone."},
      {"name": "Sitar", "description": "A large, long-necked Indian stringed instrument with a distinctive, shimmering tone."},
      {"name": "Theremin", "description": "An electronic instrument controlled without physical contact, producing an eerie, gliding sound."}
    ]
  }
]
